Reports/ЛБ_СтатистикаОбращенийКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЛБ_СтатистикаОбращенийКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитМакет</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ЛБ_ДокументыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДокументыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДУЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>Кем выдан </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСтранаЭмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаименованиеИногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СоответствиеДокументовИЛьготныхСтатусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СоответствиеДокументовИЛьготныхСтатусов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ЛьготныеСтатусыЗаемщика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НеАктуально</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Участвует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ГруппыСхемКредитования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ГруппыСхемКредитования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ГруппыСхемКредитования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СтатусыЗалогодателейДополнительные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СтатусыЗалогодателейДополнительные</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоВыкуплено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОтгружено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИзъято</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОХ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСписаноНедостача</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_Доверенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_Доверенности</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусДоверенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыДоверенностей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийДоверенность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_Доверенности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтменыОперацийЗБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтменыОперацийЗБ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОтмененныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыДокументовЗалогодателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДокументовЗалогодателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументУдостоверяющийПравоПребыванияРФ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ЛБ_СтатистикаОбращенийКлиента/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Клиент") Тогда
		Отчет.Клиент = Параметры.Клиент;		
	КонецЕсли; 
	Если Параметры.Свойство("Дата") Тогда
		Отчет.Дата = Параметры.Дата;    
	Иначе
		Отчет.Дата = ТекущаяДатаСеанса();
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(Отчет.Клиент) Тогда
		Элементы.ГруппаБыстрыеОтборы.Видимость = ложь;  
		Элементы.Отбор.ЦветФона = WebЦвета.Белый;
		СформироватьНаСервере(); 
	Иначе
		Элементы.Отбор.ЦветФона = WebЦвета.БледноЗеленый;
	КонецЕсли;	
 КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если НЕ ЗначениеЗаполнено(Отчет.Клиент) Тогда
		Сообщить("Не выбран клиент!");
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПроверитьУчастиеСКВРасчетах(Дата, СхемаКредитования, ТаблицаУчастие)
	Отбор = Новый Структура;
	Отбор.Вставить("СхемаКредитования", СхемаКредитования);
	СтрокиУ = ТаблицаУчастие.НайтиСтроки(Отбор);
	Участвует = Ложь;
	Для каждого СтрУ из СтрокиУ Цикл
		Если СтрУ.Период > Дата Тогда
			Прервать;
		КонецЕсли;	 
		Участвует = СтрУ.Участвует;	
	КонецЦикла;	
	Возврат Участвует;
КонецФункции	

Функция ВыбратьДокументыПочетный(Описание) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Отчет.Дата);  
	Запрос.УстановитьПараметр("Владелец", Отчет.Клиент);  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателей.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателей.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателей.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателей.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателей.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателей.ДокументСрокДействия КАК ДокументСрокДействия
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей КАК ЛБ_ДокументыЗалогодателей
	               |ГДЕ
	               |	ЛБ_ДокументыЗалогодателей.Период <= &Дата
	               |	И ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя.Владелец = &Владелец
	               |	И ЛБ_ДокументыЗалогодателей.ВидДокументаЗалогодателя = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент)
	               |	И ЛБ_ДокументыЗалогодателей.ДокументНеДействителен = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ДокументыЗалогодателей.Период УБЫВ";
	ДокументыЗалогодателя = Запрос.Выполнить().Выгрузить();
	
	Запрос.УстановитьПараметр("Статус", Справочники.ЛБ_СтатусыЗалогодателей.Почетный);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.ЛБ_СоответствиеДокументовИЛьготныхСтатусов.СрезПоследних(&Дата, НеАктуально = ЛОЖЬ) КАК ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл   
		СтатусЛояльности = ЛБ_УправлениеЛомбардом.ПолучитьСтатусПоСистемеЛояльности(Отчет.Дата, Выборка.статус);
		Если НЕ СтатусЛояльности = Справочники.ЛБ_СтатусыЗалогодателей.Почетный Тогда  
			Продолжить;
		КонецЕсли;	

		Отбор = Новый структура;
		Отбор.Вставить("ВидДокумента", Выборка.ВидДокумента);
		
		СтрокиД = ДокументыЗалогодателя.НайтиСтроки(Отбор); 
		Для сч = 0 По СтрокиД.Количество()-1 Цикл			
			СтрД = строкиД.Получить(сч);  
			Если НЕ (СтрД.ДокументСрокДействия = Дата(1,1,1)) Тогда
				Если СтрД.ДокументСрокДействия < НачалоДня(Отчет.Дата) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;    
			Описание = Описание + ?(ПустаяСтрока(Описание), "", Символы.ПС);    
			Описание = Описание + "наличие в карточке клиента документа " + СокрЛП(Выборка.ВидДокумента);
			Прервать;
		КонецЦикла;
	Конеццикла;	
    Возврат Описание;
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()	
	ДокументРезультат.Очистить();   
	ДатаОтчета = ?(Отчет.Дата = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.Дата)); 
	ФИО = "";
	ДатаРождения = "";
	УровеньРиска = "";
	ДатаНачалаРаботы = "";
		
	Запрос = Новый Запрос;	
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности.Период КАК Период,
	              |	ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности.СхемаКредитования КАК СхемаКредитования,
	              |	ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности.Участвует КАК Участвует
	              |ИЗ
	              |	РегистрСведений.ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности КАК ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Период";
	ТаблицаУчастие = Запрос.Выполнить().Выгрузить();
		
	Запрос.УстановитьПараметр("Дата", ДатаОтчета);  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ГруппыСхемКредитованияСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ГруппыСхемКредитованияСрезПоследних.Группа КАК Группа
	               |ИЗ
	               |	РегистрСведений.ЛБ_ГруппыСхемКредитования.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыСхемКредитованияСрезПоследних";
	ТаблицаГруппыСК = Запрос.Выполнить().Выгрузить(); 
		
	Запрос.УстановитьПараметр("Клиент", Отчет.Клиент);
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	              |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	              |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	              |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	              |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол
	              |ИЗ
	              |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ФИО = СокрЛП(Выборка.Фамилия) + " " + СокрЛП(Выборка.Имя) + ?(НЕ ПустаяСтрока(Выборка.Отчество), " " + СокрЛП(Выборка.Отчество), "");
		ДатаРождения = Выборка.ДатаРождения; 
		Пол = Выборка.Пол;
	КонецЕсли;	
	
	//+МАН 03.03.25 Изменил запрос, чтобы корректно учитывался статус ВИП. Заявка 2792
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус,
	//               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.СрокДействия КАК СрокДействия,
	//               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Используется КАК Используется,
	//               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Комментарий КАК Комментарий
	//               |ИЗ
	//               |	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних";
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус,
	               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.СрокДействия КАК СрокДействия,
	               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Используется КАК Используется,
	               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Комментарий КАК Комментарий,
	               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
	               |			&Дата,
	               |			Залогодатель = &Клиент
	               |				И ВЫБОР
	               |					КОГДА СрокДействия = ДАТАВРЕМЯ(1, 1, 1)
	               |						ТОГДА ИСТИНА
	               |					КОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(СрокДействия, ДЕНЬ), СЕКУНДА, 1) >= &Дата
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ЛОЖЬ
	               |				КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Статус КАК Статус,
	               |	ВТ.СрокДействия КАК СрокДействия,
	               |	ВТ.Используется КАК Используется,
	               |	ВТ.Комментарий КАК Комментарий,
	               |	ВТ.Регистратор КАК Регистратор
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	НЕ ВТ.Регистратор В
	               |				(ВЫБРАТЬ
	               |					ЛБ_ПриказИндивидуальныеУсловия.ОтменяемыйПриказ КАК ОтменяемыйПриказ
	               |				ИЗ
	               |					Документ.ЛБ_ПриказИндивидуальныеУсловия КАК ЛБ_ПриказИндивидуальныеУсловия
	               |				ГДЕ
	               |					НЕ ЛБ_ПриказИндивидуальныеУсловия.ПометкаУдаления
	               |					И ЛБ_ПриказИндивидуальныеУсловия.Проведен
	               |					И ЛБ_ПриказИндивидуальныеУсловия.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |					И ЛБ_ПриказИндивидуальныеУсловия.Залогодатели.Залогодатель = &Клиент)";
	
	//-МАН
	ТаблицаСтатусовКлиентаДоп = Запрос.Выполнить().Выгрузить(); 
	
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_АнкетаЗалогодателяСрезПоследних.УровеньРиска КАК УровеньРиска,
	              |	ЛБ_АнкетаЗалогодателяСрезПоследних.ДатаОформленияАнкеты КАК ДатаОформленияАнкеты
	              |ИЗ
	              |	РегистрСведений.ЛБ_АнкетаЗалогодателя.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_АнкетаЗалогодателяСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		УровеньРиска = СокрЛП(Выборка.УровеньРиска); 
		ДатаНачалаРаботы = Формат(Выборка.ДатаОформленияАнкеты, "ДЛФ=DD");
	КонецЕсли;    
	
	Статус = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДатаОтчета, Отчет.Клиент);
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("СхемаКредитования");
	ТаблицаРезультат.Колонки.Добавить("Уровень"); //2-повышение статуса, 1-понижение статуса, 0-нейтральные
	ТаблицаРезультат.Колонки.Добавить("УчастиеВРасчетах");
	ТаблицаРезультат.Колонки.Добавить("Количество");  	
	КолБилетовВсего = 0; 
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.Период КАК Период,
	               |	ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.КоличествоВыкуплено КАК КоличествоВыкуплено,
	               |	ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.КоличествоОтгружено КАК КоличествоОтгружено,
	               |	ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.КоличествоИзъято КАК КоличествоИзъято,
	               |	ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.КоличествоОХ КАК КоличествоОХ
	               |ИЗ
	               |	РегистрСведений.ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса КАК ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса
	               |ГДЕ
	               |	ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.Клиент = &Клиент
	               |	И ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.Период <= &Дата";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Для каждого стр из ТаблицаЗапроса Цикл     
		ОтборГ = Новый Структура;
		ОтборГ.Вставить("СхемаКредитования", Стр.СхемаКредитования); 
		СтрокиГ = ТаблицаГруппыСК.НайтиСтроки(ОтборГ);
		Если НЕ СтрокиГ.Количество() = 0 тогда 
			ТекущаяСхемаКредитования = СтрокиГ.Получить(0).Группа;
		Иначе
			ТекущаяСхемаКредитования = Стр.СхемаКредитования;
		КонецЕсли; 
		УчастиеВРасчетах = ПроверитьУчастиеСКВРасчетах(Стр.Период, Стр.СхемаКредитования, ТаблицаУчастие);
            
		Если НЕ (стр.КоличествоВыкуплено + стр.КоличествоОХ) = 0  Тогда
		   	НоваяСтр = ТаблицаРезультат.Добавить(); 
			НоваяСтр.СхемаКредитования = ТекущаяСхемаКредитования;
		    НоваяСтр.УчастиеВРасчетах = УчастиеВРасчетах; 
			НоваяСтр.Уровень = ?(УчастиеВРасчетах, 2, 0);  
			НоваяСтр.Количество = стр.КоличествоВыкуплено  + стр.КоличествоОХ; 
			КолБилетовВсего = КолБилетовВсего + НоваяСтр.Количество; 
		КонецЕсли;	
		Если НЕ (стр.КоличествоОтгружено + стр.КоличествоИзъято) = 0  Тогда
			НоваяСтр = ТаблицаРезультат.Добавить(); 
			НоваяСтр.СхемаКредитования = ТекущаяСхемаКредитования;
		    НоваяСтр.УчастиеВРасчетах = УчастиеВРасчетах; 
			НоваяСтр.Уровень = ?(УчастиеВРасчетах, 1, 0);  
			НоваяСтр.Количество = стр.КоличествоОтгружено + стр.КоличествоИзъято;
            КолБилетовВсего = КолБилетовВсего + НоваяСтр.Количество;
		КонецЕсли;	
	Конеццикла;	             

	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_АрхивныеДанныеКлиента.Период КАК Период,
	//               |	ЛБ_АрхивныеДанныеКлиента.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
	//               |	ЛБ_АрхивныеДанныеКлиента.СхемаКредитования КАК СхемаКредитования,
	//               |	ЛБ_АрхивныеДанныеКлиента.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
	//               |ИЗ
	//               |	РегистрСведений.ЛБ_АрхивныеДанныеКлиента КАК ЛБ_АрхивныеДанныеКлиента
	//               |ГДЕ
	//               |	ЛБ_АрхивныеДанныеКлиента.Период <= &Дата
	//               |	И ЛБ_АрхивныеДанныеКлиента.Клиент = &Клиент";
	//ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	//Для каждого стр из ТаблицаЗапроса Цикл  
	//	КолБилетовВсего = КолБилетовВсего + 1;
	//	НоваяСтр = ТаблицаРезультат.Добавить(); 
	//	ОтборГ = Новый Структура;
	//	ОтборГ.Вставить("СхемаКредитования", Стр.СхемаКредитования); 
	//	СтрокиГ = ТаблицаГруппыСК.НайтиСтроки(ОтборГ);
	//	Если НЕ СтрокиГ.Количество() = 0 тогда 
	//		НоваяСтр.СхемаКредитования = СтрокиГ.Получить(0).Группа;
	//	Иначе
	//		НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
	//	КонецЕсли;   
	//	НоваяСтр.УчастиеВРасчетах = Истина;
	//	Если Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт ИЛИ 
	//		 Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение Тогда
	//		НоваяСтр.Уровень = 2;
	//	ИначеЕсли Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен ИЛИ 
	//		      Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят Тогда
	//		НоваяСтр.Уровень = 1; 
	//	ИначеЕсли Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен ИЛИ 
	//		      Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен Тогда
	//		НоваяСтр.Уровень = 3; 	
	//	Иначе 
	//		НоваяСтр.Уровень = 0;				
	//	КонецЕсли;	 
	//	НоваяСтр.Количество = 1;
	//Конеццикла;	             
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.ЗалоговыйБилет.НомерЗалоговогоБилета КАК НомерЗБ,
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность.ПредставительКлиента КАК Представитель,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности,
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность.СрокДействияДоверенности КАК СрокДействияДоверенности
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(&Дата, Клиент = &Клиент) КАК ЛБ_ДоверенностиСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
	               |		ПО ЛБ_ДоверенностиСрезПоследних.Доверенность.ПредставительКлиента = ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ДоверенностиСрезПоследних.Период УБЫВ"; 
	ТаблицаДоверенностей = Запрос.Выполнить().Выгрузить();  
	УдалитьДов = Новый СписокЗначений;
	Для каждого стрД из ТаблицаДоверенностей Цикл  
		Если НЕ СтрД.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена Тогда
			УдалитьДов.Добавить(СтрД); 
		ИначеЕсли НЕ СтрД.СрокДействияДоверенности = Дата(1,1,1) Тогда
			Если СтрД.СрокДействияДоверенности < НачалоДня(Отчет.Дата) Тогда				
			    УдалитьДов.Добавить(СтрД);                        
			КонецЕсли;	
		КонецЕсли;	
	Конеццикла;
	Для каждого Эл Из УдалитьДов цикл
		ТаблицаДоверенностей.Удалить(Эл.Значение);
	Конеццикла;	
	              
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Период КАК Период,
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК Регистратор,
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СостояниеЗалоговогоБилета.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ВЫБОР
	               |		КОГДА ЛБ_СостояниеЗалоговогоБилета.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЛБ_СостояниеЗалоговогоБилета.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты)
	               |						ТОГДА 1
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Отмена
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.Период <= &Дата
	               |	И ЛБ_СостояниеЗалоговогоБилета.Залогодатель = &Клиент
				   //+МАН 23.06.25 Допавил проверку отмененных
				   |	И НЕ ЛБ_СостояниеЗалоговогоБилета.Регистратор В
				   |				(ВЫБРАТЬ
				   |					ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
				   |				ИЗ
				   |					РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Дата, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
				   |				ГДЕ
				   |					ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (Регистратор))
				   |	И НЕ ЛБ_СостояниеЗалоговогоБилета.Регистратор В
				   |				(ВЫБРАТЬ
				   |					ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор КАК Регистратор
				   |				ИЗ
				   |					РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Дата, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
				   |				ГДЕ
				   |					ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (Регистратор))
				   //-МАН
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ,
	               |	Отмена УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
		
	ТаблицаЗБ = ТаблицаЗапроса.Скопировать();
	ТаблицаЗБ.Свернуть("ЗалоговыйБилет");
	Для каждого СтрЗ Из ТаблицаЗБ Цикл   		
		Отбор = Новый Структура;
		Отбор.Вставить("ЗалоговыйБилет", СтрЗ.ЗалоговыйБилет); 
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		Если НЕ Строки.Количество() = 0 Тогда 
			Стр = Строки.Получить(0);
			Если ПроверитьУчастиеСКВРасчетах(Стр.ЗалоговыйБилет.Дата, Стр.СхемаКредитования, ТаблицаУчастие) Тогда  
				ОтборГ = Новый Структура;
				ОтборГ.Вставить("СхемаКредитования", Стр.СхемаКредитования); 
				СтрокиГ = ТаблицаГруппыСК.НайтиСтроки(ОтборГ);
				Если НЕ СтрокиГ.Количество() = 0 тогда 
					СхемаКредитования = СтрокиГ.Получить(0).Группа;
				Иначе
					СхемаКредитования = Стр.СхемаКредитования;
				КонецЕсли;   
				Если Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт ИЛИ 
					 Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение Тогда 
					НоваяСтр = ТаблицаРезультат.Добавить(); 
					НоваяСтр.СхемаКредитования = СхемаКредитования;
				    НоваяСтр.Количество = 1; 
					НоваяСтр.УчастиеВРасчетах = Истина; 
					НоваяСтр.Уровень = 2;  
					КолБилетовВсего = КолБилетовВсего + 1;
				ИначеЕсли Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен ИЛИ 
						  //+МАН 08.12.25 Изменил
					      //Было: Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят Тогда 
					      Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ
						  Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен Тогда
						  //-МАН
					НоваяСтр = ТаблицаРезультат.Добавить(); 
					НоваяСтр.СхемаКредитования = СхемаКредитования;
				    НоваяСтр.Количество = 1; 	  
					НоваяСтр.УчастиеВРасчетах = Истина;	  
					НоваяСтр.Уровень = 1;  
					КолБилетовВсего = КолБилетовВсего + 1;
				ИначеЕсли Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен ИЛИ 
					      Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен ИЛИ
						  Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную ИЛИ
						  Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг Тогда  
					НоваяСтр = ТаблицаРезультат.Добавить(); 
					НоваяСтр.СхемаКредитования = СхемаКредитования;
				    НоваяСтр.Количество = 1; 		  
					НоваяСтр.УчастиеВРасчетах = Истина;	  
					НоваяСтр.Уровень = 3; 
					КолБилетовВсего = КолБилетовВсего + 1;
				КонецЕсли;
			Иначе
				НоваяСтр = ТаблицаРезультат.Добавить();  
				НоваяСтр.Количество = 1; 
				НоваяСтр.Уровень = 0;
				ОтборГ = Новый Структура;
				ОтборГ.Вставить("СхемаКредитования", Стр.СхемаКредитования); 
				СтрокиГ = ТаблицаГруппыСК.НайтиСтроки(ОтборГ);
				Если НЕ СтрокиГ.Количество() = 0 тогда 
					НоваяСтр.СхемаКредитования = СтрокиГ.Получить(0).Группа;
				Иначе
					НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				КонецЕсли;   
				НоваяСтр.УчастиеВРасчетах = Ложь;
				КолБилетовВсего = КолБилетовВсего + 1;
			КонецЕсли;	
		КонецЕсли;	   
	Конеццикла;     
	
	//заполним 	таблицу-результат по группам СК
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ГруппыСхемКредитования.Период КАК Период,
	               |	ЛБ_ГруппыСхемКредитования.СхемаКредитования КАК СхемаКредитованияДляПроверки,
	               |	ЛБ_ГруппыСхемКредитования.Группа КАК СхемаКредитования
	               |ИЗ
	               |	РегистрСведений.ЛБ_ГруппыСхемКредитования КАК ЛБ_ГруппыСхемКредитования";
	Выборка = запрос.Выполнить().Выбрать();  
	Пока Выборка.Следующий() Цикл   
		Отбор = новый Структура;
		Отбор.Вставить("СхемаКредитования", Выборка.СхемаКредитования); 
		Строки = ТаблицаРезультат.НайтиСтроки(Отбор); 
        Если строки.Количество() = 0 Тогда
			НоваяСтр = ТаблицаРезультат.Добавить();
		    НоваяСтр.СхемаКредитования = Выборка.СхемаКредитования;
		    НоваяСтр.Уровень = 0; 
			Если ПроверитьУчастиеСКВРасчетах(Выборка.Период, Выборка.СхемаКредитованияДляПроверки, ТаблицаУчастие) Тогда 
				НоваяСтр.УчастиеВРасчетах = Истина;
			Иначе	
		        НоваяСтр.УчастиеВРасчетах = Ложь;
			КонецЕсли;	
		    НоваяСтр.Количество = 0;
		КонецЕсли;		
	Конеццикла;	  
	
	ТаблицаРезультат.Свернуть("СхемаКредитования, Уровень, УчастиеВРасчетах", "Количество");
	ТаблицаРезультат.Сортировать("СхемаКредитования, Уровень Убыв"); 
	ТаблицаСК = ТаблицаРезультат.Скопировать();      
	ТаблицаСК.Свернуть("СхемаКредитования, УчастиеВРасчетах");
	ТаблицаСК.Колонки.Добавить("РасчетВсего"); 
	ТаблицаСК.ЗаполнитьЗначения(0, "РасчетВсего"); 
	
	ТаблицаРезультат.Колонки.Добавить("Процент"); 
	ТаблицаРезультат.Колонки.Добавить("Примечание"); 	
	ТаблицаРезультат.ЗаполнитьЗначения(0, "Процент"); 
	ТаблицаРезультат.ЗаполнитьЗначения("", "Примечание");
	
	Для каждого СтрК Из ТаблицаСК Цикл 
		Если НЕ СтрК.УчастиеВРасчетах Тогда
			Продолжить;
		КонецЕсли;	
		Отбор = Новый Структура;
		Отбор.Вставить("СхемаКредитования", СтрК.СхемаКредитования);
		Отбор.Вставить("УчастиеВРасчетах", СтрК.УчастиеВРасчетах);
		Строки = ТаблицаРезультат.НайтиСтроки(Отбор);
		РасчетВсего = 0;
		Для каждого Стр из Строки цикл
			Если Стр.Уровень = 1 ИЛИ Стр.Уровень = 2 Тогда
				РасчетВсего = РасчетВсего + Стр.Количество;
			КонецЕсли;	
		КонецЦикла;	
		СтрК.РасчетВсего = РасчетВсего;
		Для каждого Стр из Строки цикл
			Если Стр.Уровень = 2 Тогда    
				Стр.Процент = окр(?(РасчетВсего = 0, 0, Стр.Количество/РасчетВсего*100), 2);
				Стр.Примечание = "Повышает статус клиента";
			ИначеЕсли Стр.Уровень = 1 Тогда    
				Стр.Процент = окр(?(РасчетВсего = 0, 0, Стр.Количество/РасчетВсего*100), 2);
				Стр.Примечание = "Понижает статус клиента";
			КонецЕсли;
		Конеццикла;
	Конеццикла;	 
	ТаблицаРезультат.Свернуть("СхемаКредитования, Уровень, Процент, Примечание", "Количество");
				
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Статистика_Обращений_По_Клиенту";
	
	Макет 			 = Отчет.РеквизитМакет;
    ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок"); 
	ОбластьСтатус = Макет.ПолучитьОбласть("Статус"); 
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьВсего  = Макет.ПолучитьОбласть("Всего"); 
	ОбластьТекст1  = Макет.ПолучитьОбласть("ЗБ_Текст1");
	ОбластьТекст2  = Макет.ПолучитьОбласть("ЗБ_Текст2");  
	ОбластьСтрока1  = Макет.ПолучитьОбласть("СтрокаЗБ1");
	ОбластьСтрока2  = Макет.ПолучитьОбласть("СтрокаЗБ2");
	ОбластьРиск  = Макет.ПолучитьОбласть("Риск");
	ОбластьИнф  = Макет.ПолучитьОбласть("ДопИнформация");
	ОбластьДоверенности  = Макет.ПолучитьОбласть("Доверенности");  
	ОбластьСтрокаДов  = Макет.ПолучитьОбласть("СтрокаДоверенности"); 
	
	ОбластьЗаголовок.Параметры.Клиент = ФИО; 
	ОбластьЗаголовок.Параметры.Дата = Формат(Отчет.Дата, "ДФ=dd.MM.yyyy"); 	
	ИнформацияОКлиенте = "дата рождения " + Формат(ДатаРождения, "ДЛФ=DD") + ", дата начала обслуживания " + ДатаНачалаРаботы;
	ОбластьЗаголовок.Параметры.ИнформацияОКлиенте = ИнформацияОКлиенте;
	ДокументРезультат.Вывести(ОбластьЗаголовок);  

	//+Мельников 01.07.24 Изменил порядок и добавил проверку отображения статусов. Заявка 2657
	////Если НЕ ЗначениеЗаполнено(Статус) Тогда
	//	Статус = ЛБ_УправлениеЛомбардом.ПроверкаСтатусаЗалогодателя(Отчет.Дата, Отчет.Клиент, Статус);
	////КонецЕсли;	
	//ОбластьСтатус.Параметры.Статус = СокрЛП(Статус) + ":";  
	//Если ЗначениеЗаполнено(Статус.Описание) Тогда
	//    ОбластьСтатус.Параметры.ОписаниеСтатуса = СокрЛП(Статус.Описание);
	//Иначе 
	//	ОбластьСтатус.Параметры.ОписаниеСтатуса = "Заполните описание статуса в справочнике ""Статусы клиентов""!";
	//КонецЕсли;	
	//ДокументРезультат.Вывести(ОбластьСтатус);    
	//
	//Для каждого СтрДоп Из ТаблицаСтатусовКлиентаДоп Цикл
	//	Если НЕ СтрДоп.Используется Тогда
	//		Продолжить;
	//	ИначеЕсли ЗначениеЗаполнено(СтрДоп.СрокДействия) И 	СтрДоп.СрокДействия < НачалоДня(Отчет.Дата) Тогда
	//		Продолжить;
	//	КонецЕсли;	
	//	ОбластьСтатус.Параметры.Статус = СокрЛП(СтрДоп.Статус) + ":";
	//	Если СтрДоп.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный Тогда  
	//		Возраст =  ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);
	//		Описание = "";
	//		Если Пол = Перечисления.ПолФизическогоЛица.Женский И Возраст >= 55 Тогда
	//		    Описание = "достижение пенсионного возраста 55 (жен.)";
	//		ИначеЕсли Пол = Перечисления.ПолФизическогоЛица.Мужской И Возраст >= 60 Тогда
	//		    Описание = "достижение пенсионного возраста 60 (муж.)";
	//		КонецЕсли;
	//		Описание = ВыбратьДокументыПочетный(Описание);
	//		ОбластьСтатус.Параметры.ОписаниеСтатуса = Описание;
	//	Иначе
	//		Описание = ?(ЗначениеЗаполнено(СтрДоп.СрокДействия), "действует до " + Формат(СтрДоп.СрокДействия, "ДФ=dd.MM.yyyy"), "");
	//		Описание = Описание + ?(ПустаяСтрока(СтрДоп.Комментарий), "", ?(ПустаяСтрока(Описание), "", " ") + сокрЛП(СтрДоп.Комментарий));
	//		ОбластьСтатус.Параметры.ОписаниеСтатуса = Описание;
	//	КонецЕсли;	
	//    ДокументРезультат.Вывести(ОбластьСтатус);    
	//КонецЦикла;
	
	ОтборВИП = Новый Структура;
	ОтборВИП.Вставить("Статус", Справочники.ЛБ_СтатусыЗалогодателей.VIP);
	ОтборВИП.Вставить("Используется", Истина);
	
	ОтборСотрудник = Новый Структура;
	ОтборСотрудник.Вставить("Статус", Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник);
	ОтборСотрудник.Вставить("Используется", Истина);

	ОтборПочетный = Новый Структура;
	ОтборПочетный.Вставить("Статус", Справочники.ЛБ_СтатусыЗалогодателей.Почетный);
	ОтборПочетный.Вставить("Используется", Истина);

	мВИП = ТаблицаСтатусовКлиентаДоп.НайтиСтроки(ОтборВИП);
	мСотрудник = ТаблицаСтатусовКлиентаДоп.НайтиСтроки(ОтборСотрудник);
	мПочетный = ТаблицаСтатусовКлиентаДоп.НайтиСтроки(ОтборПочетный);
	
	Если мВИП.Количество() > 0 ИЛИ мСотрудник.Количество() > 0 ИЛИ мПочетный.Количество() > 0 Тогда

		ОбластьСтатус.Параметры.ТипСтатуса = "Приоритетный статус: ";

		Если мВИП.Количество() > 0 Тогда
			
			ОбластьСтатус.Параметры.Статус = Справочники.ЛБ_СтатусыЗалогодателей.VIP.Наименование + ":";
			//+МАН 03.03.25 Добавил прибавление дня, чтобы соответствовало тексту т.к. в регистре идет запись в виде "по день". Заявка 2792
			//Было: Описание = ?(ЗначениеЗаполнено(мВИП[0].СрокДействия), "действует до " + Формат(мВИП[0].СрокДействия, "ДФ=dd.MM.yyyy"), "");
			//+МАН 07.04.25
			//Описание = ?(ЗначениеЗаполнено(мВИП[0].СрокДействия), "действует до " + Формат(КонецДня(мВИП[0].СрокДействия) + 1, "ДФ=dd.MM.yyyy"), "");
			Описание = ?(ЗначениеЗаполнено(мВИП[0].СрокДействия), "действует по " + Формат(мВИП[0].СрокДействия, "ДФ=dd.MM.yyyy"), "");
			//-МАН
			Описание = Описание + ?(ПустаяСтрока(мВИП[0].Комментарий), "", ?(ПустаяСтрока(Описание), "", " ") + сокрЛП(мВИП[0].Комментарий));
			ОбластьСтатус.Параметры.ОписаниеСтатуса = Описание;
			
		ИначеЕсли мВИП.Количество() = 0 И мСотрудник.Количество() > 0 Тогда
			
			ОбластьСтатус.Параметры.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник.Наименование + ":";
			//+МАН 07.04.25
			//Было: Описание = ?(ЗначениеЗаполнено(мСотрудник[0].СрокДействия), "действует до " + Формат(мСотрудник[0].СрокДействия, "ДФ=dd.MM.yyyy"), "");
			Описание = ?(ЗначениеЗаполнено(мСотрудник[0].СрокДействия), "действует по " + Формат(мСотрудник[0].СрокДействия, "ДФ=dd.MM.yyyy"), "");
			//-МАН
			Описание = Описание + ?(ПустаяСтрока(мСотрудник[0].Комментарий), "", ?(ПустаяСтрока(Описание), "", " ") + сокрЛП(мСотрудник[0].Комментарий));
			ОбластьСтатус.Параметры.ОписаниеСтатуса = Описание;
			
		ИначеЕсли мВИП.Количество() = 0 И мСотрудник.Количество() = 0 И мПочетный.Количество() > 0 Тогда
			
			ОбластьСтатус.Параметры.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный.Наименование + ":";
			Возраст =  ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);
			Описание = "";
			
			Если Пол = Перечисления.ПолФизическогоЛица.Женский И Возраст >= 55 Тогда
				Описание = "достижение пенсионного возраста 55 (жен.)";
			ИначеЕсли Пол = Перечисления.ПолФизическогоЛица.Мужской И Возраст >= 60 Тогда
				Описание = "достижение пенсионного возраста 60 (муж.)";
			КонецЕсли;
			
			Описание = ВыбратьДокументыПочетный(Описание);
			ОбластьСтатус.Параметры.ОписаниеСтатуса = Описание;
			
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьСтатус);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = ЛБ_УправлениеЛомбардом.ПроверкаСтатусаЗалогодателя(Отчет.Дата, Отчет.Клиент, Статус);
	КонецЕсли;	
	ОбластьСтатус.Параметры.ТипСтатуса = "Расчетный статус: ";
	ОбластьСтатус.Параметры.Статус = СокрЛП(Статус) + ":";  
	Если ЗначениеЗаполнено(Статус.Описание) Тогда
	    ОбластьСтатус.Параметры.ОписаниеСтатуса = СокрЛП(Статус.Описание);
	Иначе 
		ОбластьСтатус.Параметры.ОписаниеСтатуса = "Заполните описание статуса в справочнике ""Статусы клиентов""!";
	КонецЕсли;	
	ДокументРезультат.Вывести(ОбластьСтатус);
	//-Мельников

	ДокументРезультат.Вывести(ОбластьШапка);
	
	ОбластьВсего.Параметры.количество = КолБилетовВсего;
    ДокументРезультат.Вывести(ОбластьВсего); 
	
	ДокументРезультат.Вывести(ОбластьТекст1);
	Для каждого СтрК Из ТаблицаСК Цикл  
		Если НЕ СтрК.УчастиеВРасчетах Тогда
			Продолжить;
		КонецЕсли;	
		Отбор = Новый Структура;
		Отбор.Вставить("СхемаКредитования", СтрК.СхемаКредитования);
		Отбор.Вставить("Уровень", 2);
		Строки = ТаблицаРезультат.НайтиСтроки(Отбор); 
		Если Строки.Количество() = 0 Тогда 
			ОбластьСтрока1.Параметры.СК = СтрК.СхемаКредитования;
			ОбластьСтрока1.Параметры.Статус = "(" + Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт) + " / " +  Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение) + ")";
			ОбластьСтрока1.Параметры.Количество = 0;
			ОбластьСтрока1.Параметры.Процент = 0; 
			ОбластьСтрока1.Параметры.Примечание = "Повышает статус клиента";
		Иначе	
			Стр = строки.Получить(0);
			ОбластьСтрока1.Параметры.СК = Стр.СхемаКредитования;
			ОбластьСтрока1.Параметры.Статус = "(" + Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт) + " / " +  Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение) + ")";
			ОбластьСтрока1.Параметры.Количество = Стр.Количество;
			ОбластьСтрока1.Параметры.Процент = Стр.Процент; 
			ОбластьСтрока1.Параметры.Примечание = Стр.Примечание;
		КонецЕсли;  
		ДокументРезультат.Вывести(ОбластьСтрока1);
		
		Отбор.Вставить("Уровень", 1);
		Строки = ТаблицаРезультат.НайтиСтроки(Отбор);		
		Если Строки.Количество() = 0 Тогда
			ОбластьСтрока1.Параметры.СК = СтрК.СхемаКредитования;
			ОбластьСтрока1.Параметры.Статус = "(" + Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен) + " / " +  Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят)// + ")";
			//+МАН 08.12.25 Добавил
			+ " / " +  Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен) + ")";
			//-МАН
			ОбластьСтрока1.Параметры.Количество = 0;
			ОбластьСтрока1.Параметры.Процент = 0; 
			ОбластьСтрока1.Параметры.Примечание = "Понижает статус клиента";
		Иначе	       
			Стр = строки.Получить(0);
			ОбластьСтрока1.Параметры.СК = Стр.СхемаКредитования;
			ОбластьСтрока1.Параметры.Статус = "(" + Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен) + " / " +  Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят)// + ")";
			//+МАН 08.12.25 Добавил
			+ " / " +  Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен) + ")";
			//-МАН
			ОбластьСтрока1.Параметры.Количество = Стр.Количество;
			ОбластьСтрока1.Параметры.Процент = Стр.Процент; 
			ОбластьСтрока1.Параметры.Примечание = Стр.Примечание;
		КонецЕсли; 
		ДокументРезультат.Вывести(ОбластьСтрока1);
	КонецЦикла;
	
	ДокументРезультат.Вывести(ОбластьТекст2); 
	ОтборСК = Новый Структура;        
    ОтборСК.Вставить("УчастиеВРасчетах", Истина);
	СтрокиСК3 = ТаблицаСК.НайтиСтроки(ОтборСК);	
	Для каждого СтрК Из СтрокиСК3 Цикл 
		Отбор = Новый Структура; 
		Отбор.Вставить("СхемаКредитования", СтрК.СхемаКредитования);
		Отбор.Вставить("Уровень", 3);	
		Строки = ТаблицаРезультат.НайтиСтроки(Отбор); 	
		Если Строки.Количество() = 0 Тогда  
			ОбластьСтрока2.Параметры.СК = СтрК.СхемаКредитования;
			//+МАН 05.12.25 Изменил
			//ОбластьСтрока2.Параметры.Статус = "(" + Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен) + " / " +  Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен) + ")";
			ОбластьСтрока2.Параметры.Статус = "(" + Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен) + " / " +  Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен) + " / "
			+ Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную) + " / " +  Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг) + ")";
			//-МАН
			ОбластьСтрока2.Параметры.Количество = 0;  
		Иначе	       
			Стр = строки.Получить(0);
			ОбластьСтрока2.Параметры.СК = Стр.СхемаКредитования;
			//+МАН 05.12.25
			//ОбластьСтрока2.Параметры.Статус = "(" + Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен) + " / " +  Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен) + ")";
			ОбластьСтрока2.Параметры.Статус = "(" + Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен) + " / " +  Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен) + " / "
			+ Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную) + " / " +  Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг) + ")";
			//-МАН
			ОбластьСтрока2.Параметры.Количество = Стр.Количество;
		КонецЕсли;  
		ДокументРезультат.Вывести(ОбластьСтрока2); 
	КонецЦикла;	
	
	ОтборСК = Новый Структура;        
    ОтборСК.Вставить("УчастиеВРасчетах", Ложь);
	СтрокиСК = ТаблицаСК.НайтиСтроки(ОтборСК);
	Для каждого СтрК Из СтрокиСК Цикл 
        Отбор = Новый Структура; 
		Отбор.Вставить("СхемаКредитования", СтрК.СхемаКредитования);
		Отбор.Вставить("Уровень", 0);	
		Строки = ТаблицаРезультат.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда   
			ОбластьСтрока2.Параметры.СК = Стр.СхемаКредитования;
			ОбластьСтрока2.Параметры.Количество = 0;	
			ДокументРезультат.Вывести(ОбластьСтрока2);
		Иначе	
			Для каждого Стр Из Строки Цикл 
				ОбластьСтрока2.Параметры.СК = Стр.СхемаКредитования;
				ОбластьСтрока2.Параметры.Статус = "";
				ОбластьСтрока2.Параметры.Количество = Стр.Количество;	
				ДокументРезультат.Вывести(ОбластьСтрока2);
			 КонецЦикла; 
		КонецЕсли;	 
	 КонецЦикла;
	 
	Если Статус = Справочники.ЛБ_СтатусыЗалогодателей.Постоянный Тогда
		ИнформацияДляКлиента = "";
	Иначе     
		ОтборСК = Новый Структура;
		ОтборСК.Вставить("УчастиеВРасчетах", ложь);
		СтрокиСК = ТаблицаСК.НайтиСтроки(ОтборСК);   
		Для каждого СтрСК Из СтрокиСК Цикл  
			ТаблицаСК.Удалить(СтрСК);
		Конеццикла;	
		ИнформацияДляКлиента = ПолучитьИнформациюДляКлиента(Статус, ТаблицаСК, ТаблицаРезультат);
	КонецЕсли;	    
	ОбластьИнф.Параметры.ИнформацияДляКлиента = ИнформацияДляКлиента; 
	ДокументРезультат.Вывести(ОбластьИнф); 
	
		
	КолД = ТаблицаДоверенностей.Количество(); 
	ОбластьДоверенности.Параметры.КолД = КолД;
	ДокументРезультат.Вывести(ОбластьДоверенности); 
	
	Для каждого стрД из ТаблицаДоверенностей Цикл  
		ОбластьСтрокаДов.Параметры.НомерЗБ = СтрД.НомерЗБ;  
		ОбластьСтрокаДов.Параметры.Представитель = СтрД.Представитель;
		ОбластьСтрокаДов.Параметры.ДатаРождения = Формат(СтрД.ДатаРождения, "ДФ=dd.MM.yyyy");
		ДокументРезультат.Вывести(ОбластьСтрокаДов);
	КонецЦикла;
	
	ОбластьРиск.Параметры.УровеньРиска = УровеньРиска;  
	ДокументРезультат.Вывести(ОбластьРиск); 
КонецПроцедуры 

&НаСервере
Функция ПолучитьИнформациюДляКлиента(Статус, ТаблицаСК, ТаблицаРезультат)
	Если Статус = неопределено тогда
		Возврат "";
	КонецЕсли;    
	Если ТаблицаСК.Количество() = 0 Тогда
	    Возврат "Для повышения статуса необходимо выкупить 3 ЗБ с видом займа, участвующем в расчетах по системе лояльности"; 
	КонецЕсли;	
	ТаблицаСК.Колонки.Добавить("Количество");
	ТаблицаСК.ЗаполнитьЗначения(0, "Количество"); 
	ДобавитьКорректировкаПонижения = 0;
	 
	Для каждого СтрК Из ТаблицаСК Цикл  
		Если стрК.РасчетВсего = 0 Тогда
			Продолжить;
		КонецЕсли;	
		РасчетВсего = стрК.РасчетВсего;
		Отбор = Новый Структура;
		Отбор.Вставить("СхемаКредитования", СтрК.СхемаКредитования);
		Отбор.Вставить("Уровень", 2);//повышает уровень
		Строки = ТаблицаРезультат.НайтиСтроки(Отбор); 
		Если Строки.Количество() = 0 Тогда  
			Количество = 0;
		Иначе
			Количество = Строки.Получить(0).Количество;
		КонецЕсли; 
		//+МАН 23.01.25 Для дальнейшего сравнения. Заявка 2956.
		КоличествоУр2 = Количество;
		//-МАН
		Отбор.Вставить("Уровень", 1); //понижает   
		ДобавитьКорректировкаПонижения = 0;
		Строки = ТаблицаРезультат.НайтиСтроки(Отбор); 
		Если НЕ Строки.Количество() = 0 Тогда 
			ДобавитьКорректировкаПонижения = Строки.Получить(0).Количество;
			Количество = Количество + ДобавитьКорректировкаПонижения;
			РасчетВсего = РасчетВсего + ДобавитьКорректировкаПонижения; 
			Если (Статус = Справочники.ЛБ_СтатусыЗалогодателей.Добросовестный) И (Количество >= 5) И (Количество/РасчетВсего*100 >= 90) Тогда   
				Возврат "Для повышения статуса необходимо выкупить " + Строка(ДобавитьКорректировкаПонижения) + " ЗБ " + СокрЛП(СтрК.СхемаКредитования);
			ИначеЕсли НЕ (Статус = Справочники.ЛБ_СтатусыЗалогодателей.Добросовестный) И (Количество/РасчетВсего*100 >= 70) Тогда
				Возврат "Для повышения статуса необходимо выкупить " + Строка(ДобавитьКорректировкаПонижения) + " ЗБ " + СокрЛП(СтрК.СхемаКредитования);
			КонецЕсли;	
		КонецЕсли;   
		КолДобавить = 1; 
		РасчетВсего = РасчетВсего + КолДобавить;
		Количество = Количество + КолДобавить;
		Пока Истина Цикл 
			Если Количество/РасчетВсего*100 < 70 Тогда 
				КолДобавить = КолДобавить + 1;
				РасчетВсего = РасчетВсего + 1;  
				Количество = Количество + 1;
			Иначе  
				Если (Статус = Справочники.ЛБ_СтатусыЗалогодателей.Добросовестный) Тогда  
					Если Количество < 5 Тогда
						КолДобавить = КолДобавить + 1;
					    РасчетВсего = РасчетВсего + 1;  
					    Количество = Количество + 1;
						Продолжить;  
					ИначеЕсли Количество/РасчетВсего*100 < 90 Тогда 
						КолДобавить = КолДобавить + 1;
					    РасчетВсего = РасчетВсего + 1;  
					    Количество = Количество + 1;
						Продолжить; 
					КонецЕсли;	
				КонецЕсли;
				//+МАН 23.01.25 Проверяем новый или нет и сколько ЗБ. Заявка 2956.
				//Было:
				//СтрК.Количество = КолДобавить;
				//Прервать;
				//
				Если Статус = Справочники.ЛБ_СтатусыЗалогодателей.Новый И КоличествоУр2 = 1 Тогда
					СтрК.Количество = 2;
					Прервать;
				Иначе
					СтрК.Количество = КолДобавить;
					Прервать;
				КонецЕсли;
				//-МАН
			КонецЕсли;	
		КонецЦикла	 
    КонецЦикла;		 
	
	ТаблицаСК.Сортировать("Количество Возр"); 
	СтрК = ТаблицаСК.Получить(0);  
	СтрК.Количество = СтрК.Количество + ДобавитьКорректировкаПонижения;
	СтрК.Количество = ?(СтрК.Количество = 0, 3, СтрК.Количество);
	//+Мельников 16.07.24 Если количество ЗБ для повышения статуса больше 10 то ни чего не выводим. Заявка 2657
	//Добавил условие. Первоначальный "Возврат" после "Иначе".
	Если СтрК.Количество > 10 Тогда
		Возврат "";
	Иначе
	//-Мельников
		Возврат "Для повышения статуса необходимо выкупить " + Строка(СтрК.Количество) + " ЗБ " + СокрЛП(СтрК.СхемаКредитования);
	КонецЕсли;
КонецФункции	

&НаКлиенте
Процедура КлиентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь; 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Дата", Отчет.Дата);	
    ПараметрыФормы.Вставить("БезДокументов", истина);
	Если ЗначениеЗаполнено(Отчет.Клиент) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Отчет.Клиент);
	КонецЕсли;		
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКлиента",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКлиента(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;   
	
	Отчет.Клиент = Результат.Залогодатель;
КонецПроцедуры 

&НаКлиенте
Процедура Отбор(Команда)
	Если Элементы.ГруппаБыстрыеОтборы.Видимость Тогда 
		Элементы.ГруппаБыстрыеОтборы.Видимость = Ложь;
		Элементы.Отбор.ЦветФона = WebЦвета.Белый;
	Иначе 
		Элементы.ГруппаБыстрыеОтборы.Видимость = Истина;
		Элементы.Отбор.ЦветФона = WebЦвета.БледноЗеленый;
	КонецЕсли;	
КонецПроцедуры
